In [1]:
%load_ext sql

In [2]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [4]:
%sql select * from order_tbl limit 5

 * sqlite:///./test.db
Done.

[('2015-05-01', 'ODR1', 'PROD1', 5, 5),
 ('2015-05-01', 'ODR2', 'PROD2', 2, 10),
 ('2015-05-01', 'ODR3', 'PROD3', 10, 25),
 ('2015-05-01', 'ODR4', 'PROD1', 20, 5),
 ('2015-05-02', 'ODR5', 'PROD3', 5, 25)]

SQL to get highest sold products(Quantity * Price) on both days

In [18]:
%%sql 
select * from (
select order_day,product_id,quantity*price total_revenue, 
row_number() over (partition by order_day order by quantity*price desc) rnk
from order_tbl)x where rnk=1

 * sqlite:///./test.db
Done.

[('2015-05-01', 'PROD3', 250, 1), ('2015-05-02', 'PROD3', 125, 1)]

SQL to get all products total sales on 1st May and 2nd May adjecent to each other

In [14]:
%%sql
select product_id,
        sum(case when order_day='2015-05-01' then quantity * price else 0 end) as sales_01,
        sum(case when order_day='2015-05-02' then quantity * price else 0 end) as sales_02
from order_tbl
group by product_id

 * sqlite:///./test.db
Done.

[('PROD1', 125, 10),
 ('PROD2', 20, 40),
 ('PROD3', 250, 125),
 ('PROD4', 0, 120),
 ('PROD5', 0, 50),
 ('PROD6', 0, 100)]